/*Да се напише програма во која што се внесува еден четирицифрен и еден трицифрен број.
 * Да се отпечати 1 доколку сумата на цифрите на првиот број е поголема од сумата на цифрите
 * на вториот број, во спротивно 0.
 */

#include <stdio.h>

int main() {
    int a, b;
    scanf("%d %d", &a, &b);
    int n1 = a / 1000;
    int n2 = (a / 100) % 10;
    int n3 = (a / 10) % 10;
    int n4 = a % 10;
    int sum1 = n1 + n2 + n3 + n4;

    int m1 = b / 100;
    int m2 = (b / 10) % 10;
    int m3 = b % 10;
    int sum2 = m1 + m2 + m3;

    if (sum1 > sum2) {
        printf("1");
    } else {
        printf("0");
    }
}